宜 = {
    "出行": "一路顺风",
    "上课": "100%消化",
    "搞基": "友谊地久天长",
    "丧葬": "灵魂得到安息",
    "睡觉": "养足精力，明日再战",
    "考试": "学的全会，蒙的全对",
    "装弱": "被识破",
    "写作文":  "非常有文采",
    "泡妹子": "说不定可以牵手",
    "参加CSP": "祝你rp++",
    "纳财": "要到好多money",
    "发朋友圈": "分享是种美德",
    "背诵课文": "看一遍就背下来了",
    "参加模拟赛": "可以AK虐全场",
    "继续完成WA的题": "下一次就可以AC了",
    "打chunithm": "您虹了",

}

# 万事皆宜

忌 = {
    "熬夜": "爆肝",
    "刷题": "容易WA",
    "吃饭": "小心变胖啊",
    "睡觉": "翻来覆去睡不着",
    "写作文":  "可能会离题",

    "写作业": "上课讲了这些了吗",
    "泡妹子": "一定会被拒绝",
    "扶老奶奶过马路": "会被讹",
    "重构代码": "越改越乱",
    "发朋友圈": "会被当做卖面膜的",
    "背诵课文": "记忆力只有50Byte",
    "学习珂学": "珂朵莉不知干啥不理你",

    "继续完成WA的题": "然而变成了TLE",

}

运势 = ('大吉', '中吉', '小吉', '中平', '凶', '大凶', '特大吉')


# 诸事不宜
